holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
/*
  Serial Information Command - Written By Benjamin Jack Cullen
*/

#include "serial_infocmd.h"
#include <Arduino.h>
#include "matrix.h"
#include "wtgps300p.h"
#include "wt901.h"
#include "multiplexers.h"
#include "custommapping.h"
#include "sidereal_helper.h"
#include "satio.h"
#include "ins.h"
#include "meteors.h"
#include "hextodig.h"
#include "esp32_helper.h"
#include "sdmmc_helper.h"
#include "arg_parser.h"
#include "system_data.h"
#include <FS.h>
#include "SD_MMC.h"
#include "SPIFFS.h"
#include <stdlib.h>
#include "satio_file.h"
#include <limits.h>
#include <float.h>
#include "matrix.h"

bool debug_bool=true;
void debug(String debug_str) {if (debug_bool==true) {Serial.println(debug_str);}}

ArgParser parser;
PlainArgParser plainparser;

struct Serial0Struct serial0Data = {
  .nbytes=0, // number of bytes read by serial.
  .iter_token=0, // count token iterations.
  .BUFFER={}, // serial buffer.
  .token=0, // token pointer.
  .checksum=0,
  .checksum_of_buffer=0,
  .checksum_in_buffer=0,
  .gotSum=0,
  .i_XOR=0,
  .XOR=0,
  .c_XOR=0,
};

int getCheckSumSerial0(char * string) {
  for (serial0Data.XOR=0, serial0Data.i_XOR=0; serial0Data.i_XOR < strlen(string); serial0Data.i_XOR++) {
    serial0Data.c_XOR=(unsigned char)string[serial0Data.i_XOR];
    if (serial0Data.c_XOR=='*') break;
    if (serial0Data.c_XOR != '$') serial0Data.XOR ^= serial0Data.c_XOR;
  }
  return serial0Data.XOR;
}

bool validateChecksumSerial0(char * buffer) {
  memset(serial0Data.gotSum, 0, sizeof(serial0Data.gotSum));
  serial0Data.gotSum[0]=buffer[strlen(buffer) - 3];
  serial0Data.gotSum[1]=buffer[strlen(buffer) - 2];
  serial0Data.checksum_of_buffer= getCheckSumSerial0(buffer);
  serial0Data.checksum_in_buffer=h2d2(serial0Data.gotSum[0], serial0Data.gotSum[1]);
  if (serial0Data.checksum_in_buffer==serial0Data.checksum_of_buffer) {return true;}
  return false;
}

void createChecksumSerial0(char * buffer) {
  serial0Data.checksum_of_buffer=getCheckSumSerial0(buffer);
  sprintf(serial0Data.checksum,"%X",serial0Data.checksum_of_buffer);
}

bool val_global_element_size(const char * data) {
  if (sizeof(data)>=MAX_GLOBAL_ELEMENT_SIZE) {return false;}
  return true;
}

bool val_switch_index(const char * data) {
  if (str_is_int8(data)) {if (atol(data)<MAX_MATRIX_SWITCHES) {return true;}}
  return false;
}

bool val_function_index(const char * data) {
  if (str_is_int8(data)) {if (atol(data)<MAX_MATRIX_SWITCH_FUNCTIONS) {return true;}}
  return false;
}

bool val_speed_units(const char * data) {
  if (str_is_int8(data)) {if (atol(data)<MAX_SPEED_CONVERSION_MODES) {return true;}}
  return false;
}

bool val_function_name_index(const char * data) {
  if (val_global_element_size(data)==false) {return false;}
  if (str_is_long(data)!=true) {return false;}
  if (atol(data) < MAX_MATRIX_FUNCTION_NAMES) {return true;}
  return false;
}

bool val_function_xyz(const char * data) {
  if (str_is_double(data)) {return true;}
  return false;
}

bool val_function_operator(const char * data) {
  if (str_is_int8(data)) {return true;}
  return false;
}

bool val_switch_port(const char * data) {
  if (str_is_int8(data)) {return true;}
  return false;
}

bool val_mappable_value_index(const char * data) {
  Serial.println(data);
  if (str_is_int8(data)!=true) {return false;}
  if (atoi(data)<MAX_MAPPABLE_VALUES) {return true;} 
  return false;
}

bool val_map_slot_index(const char * data) {
  Serial.println(data);
  if (str_is_int8(data)!=true) {return false;}
  if (atoi(data)<MAX_MAP_SLOTS) {return true;} 
  return false;
}

bool val_ins_mode(const char * data) {
  if (str_is_int8(data)) {if (atol(data)<MAX_INS_MODE) {return true;}}
  return false;
}

bool val_ins_gps_precision(const char * data) {
  if (str_is_float(data)) {return true;}
  return false;
}

bool val_ins_minimum_speed(const char * data) {
  if (str_is_float(data)) {return true;}
  return false;
}

bool val_ins_heading_range_diff(const char * data) {
  if (str_is_float(data)) {return true;}
  return false;
}

static void PrintHelp(void) {
  Serial.println(
  R"(
  [ System ]

      system --save
      system --load
      system --restore-defaults

  [ Matrix ]

      matrix --new                Clears matrix in memory.
      matrix --save n             Specify file slot.
      matrix --load n             Specify file slot.
      matrix --delete n           Specify file slot.
      matrix --startup-enable
      matrix --startup-disable
      matrix -s n                 Specify switch index n.
      matrix -f n                 Specify function index n.
      matrix -p n                 Set port for switch -s.
      matrix -fn n                Set function -f for switch -s. See available matrix functions.
                                  [0] None
                                  [1] On
                                  [2] SwitchLink
                                  [3] LocalTime
                                  [4] Weekday
                                  [5] DateDayX
                                  [6] DateMonthX
                                  [7] DateYearX
                                  [8] DegLat
                                  [9] DegLon
                                  [10] DegLatLon
                                  [11] INSLat
                                  [12] INSLon
                                  [13] INSLatLon
                                  [14] INSHeading
                                  [15] INSSpeed
                                  [16] INSAltitude
                                  [17] UTCTimeGNGGA
                                  [18] PosStatusGNGGA
                                  [19] SatCount
                                  [20] HemiGNGGANorth
                                  [21] HemiGNGGASouth
                                  [22] HemiGNGGAEast
                                  [23] HemiGNGGAWest
                                  [24] GPSPrecision
                                  [25] AltGNGGA
                                  [26] UTCTimeGNRMC
                                  [27] PosStatusGNRMCA
                                  [28] PosStatusGNRMCV
                                  [29] ModeGNRMCA
                                  [30] ModeGNRMCD
                                  [31] ModeGNRMCE
                                  [32] ModeGNRMCN
                                  [33] HemiGNRMCNorth
                                  [34] HemiGNRMCSouth
                                  [35] HemiGNRMCEast
                                  [36] HemiGNRMCWest
                                  [37] GSpeedGNRMC
                                  [38] HeadingGNRMC
                                  [39] UTCDateGNRMC
                                  [40] LFlagGPATT
                                  [41] SFlagGPATT
                                  [42] RSFlagGPATT
                                  [43] INSGPATT
                                  [44] SpeedNumGPATT
                                  [45] MileageGPATT
                                  [46] GSTDataGPATT
                                  [47] YawGPATT
                                  [48] RollGPATT
                                  [49] PitchGPATT
                                  [50] GNGGAValidCS
                                  [51] GNRMCValidCS
                                  [52] GPATTValidCS
                                  [53] GNGGAValidCD
                                  [54] GNRMCValidCD
                                  [55] GPATTValidCD
                                  [56] Gyro0AccX
                                  [57] Gyro0AccY
                                  [58] Gyro0AccZ
                                  [59] Gyro0AngX
                                  [60] Gyro0AngY
                                  [61] Gyro0AngZ
                                  [62] Gyro0MagX
                                  [63] Gyro0MagY
                                  [64] Gyro0MagZ
                                  [65] Gyro0GyroX
                                  [66] Gyro0GyroY
                                  [67] Gyro0GyroZ
                                  [68] Meteors
                                  [69] SunAz
                                  [70] SunAlt
                                  [71] MoonAz
                                  [72] MoonAlt
                                  [73] MoonPhase
                                  [74] MercuryAz
                                  [75] MercuryAlt
                                  [76] VenusAz
                                  [77] VenusAlt
                                  [78] MarsAz
                                  [79] MarsAlt
                                  [80] JupiterAz
                                  [81] JupiterAlt
                                  [82] SaturnAz
                                  [83] SaturnAlt
                                  [84] UranusAz
                                  [85] UranusAlt
                                  [86] NeptuneAz
                                  [87] NeptuneAlt
                                  [88] ADMPlex0
                                  [89] MappedValue
                                  [90] SDCARDInserted
                                  [91] SDCARDMounted
      matrix -fx n                Set function -f value x for switch -s.
      matrix -fy n                Set function -f value y for switch -s.
      matrix -fz n                Set function -f value z for switch -s.
      matrix -fi n                Set function -f logic inverted for switch -s.
      matrix -fo n                Set function -f operator for switch -s.
                                  [0] None
                                  [1] Equal
                                  [2] Over
                                  [3] Under
                                  [4] Range
      matrix --pwm0 n             Set switch -s uS time off period (0uS = remain on)
      matrix --pwm1 n             Set switch -s uS time on period  (0uS = remain off after on)
      matrix --flux n             Set switch -s output fluctuation threshold.
      matrix --oride n            Override switch -s output values.
      matrix --computer-assist n  Enable/disable computer assist for switch -s.
      matrix --omode n            Set switch -s output mode: (0 : matrix logic) (1 : mapped value analog/digital).
      matrix --map-slot n         Set switch -s output as map slot n value.

      example set matrix logic 0 function 0 to detect sdcard mounted:
      matrix -s 0 -f 0 -p 33 -fn 91 -fx 1 -fo 1 --pwm0 1000000 --pwm1 15000 --computer-assist 1
      matrix -s 0 --omode 0

  [ Mapping ]

      map --new      Clears all mapping in memory.
      map --save
      map --load
      map --delete
      map -s n       Specify map slot n.
      map -m n       Specify slot -s mode. (0 : map min to max) (1 : center map x0) (2 : center map x1)
      map -c0 n      Configuration map slot -s value to map. See available map values.
                     [0] Digital
                     [1] YawGPATT
                     [2] RollGPATT
                     [3] PitchGPATT
                     [4] Gyro0AccX
                     [5] Gyro0AccY
                     [6] Gyro0AccZ
                     [7] Gyro0AngX
                     [8] Gyro0AngY
                     [9] Gyro0AngZ
                     [10] Gyro0MagX
                     [11] Gyro0MagY
                     [12] Gyro0MagZ
                     [13] Gyro0GyroX
                     [14] Gyro0GyroY
                     [15] Gyro0GyroZ
                     [16] ADMPlex0_0
                     [17] ADMPlex0_1
                     [18] ADMPlex0_2
                     [19] ADMPlex0_3
                     [20] ADMPlex0_4
                     [21] ADMPlex0_5
                     [22] ADMPlex0_6
                     [23] ADMPlex0_7
                     [24] ADMPlex0_8
                     [25] ADMPlex0_9
                     [26] ADMPlex0_10
                     [27] ADMPlex0_11
                     [28] ADMPlex0_12
                     [29] ADMPlex0_13
                     [30] ADMPlex0_14
                     [31] ADMPlex0_15
      map -c1 n      Configuration map slot -s. (mode 0 : in_min)  (mode 1 : approximate center value)
      map -c2 n      Configuration map slot -s. (mode 0 : in_max)  (mode 1 : Neg_range : 0 to approximate center value)
      map -c3 n      Configuration map slot -s. (mode 0 : out_min) (mode 1 : Pos_range : ADC max - neg range)
      map -c4 n      Configuration map slot -s. (mode 0 : out_max) (mode 1 : out_max)
      map -c5 n      Configuration map slot -s. (mode 1 only : DEADZONE : expected flutuation at center)

      example map analog stick axis x0 on admplex0 channel 0 into map slot 0:
      map -s 0 -m 1 -c0 16 -c1 1974 -c2 1974 -c3 1894 -c4 255 -c5 50
      matrix -s 0 --map-slot 0
      Optional: matrix -s 0 --omode 1

      example map analog stick axis x1 on admplex0 channel 1 into map slot 1:
      map -s 1 -m 2 -c0 17 -c1 1974 -c2 1974 -c3 1894 -c4 255 -c5 50
      matrix -s 1 --map-slot 1
      Optional: matrix -s 1 --omode 1

  [ INS ]

      ins -m n              Set INS mode n. (0 : Off) (1 : Dynamic, set by gps every 100ms) (2 : Fixed, remains on after conditions met).
      ins -gyro n           INS uses gyro for attitude. (0 : gyro heading) (1 : gps heading).
      ins -p n              Set INS mimimum required gps precision factor to initialize.
      ins -s n              Set INS mimimum required speed to initialize.
      ins -r n              Set INS maximum required heading range difference to initialize (difference between gps heading and gyro heading).
      ins --reset-forced    Reset INS remains on after conditions met.

  [ Satio ]

      satio --speed-units n            Set displayed units (0 : M/S) (1 : MPH) (2 : KPH) (3 : KTS estimated)
      satio --mode-gngga               Use GNGGA data for location.
      satio --mode-gnrmc               Use GNRMC data for location.
      satio --mode-static              Retain any cureently set degrees latiude, longitude. 
      satio --set-coord -lat 0 -lon n  Set degrees latitude and longitude. (ensure --mode-static before --set-coord).
      satio --utc-offset n             Set +-seconds offset time.
      satio --auto-datetime-on         Enable set datetime automatically  (--auto-datetime-on overrides any datetime -set).
      satio --auto-datetime-off        Disable set datetime automatically (ensure --auto-datetime-off before using -set time).
      satio --set-datetime --year n --month n --mday n --hour n --minute n --second n  (must be UTC except if utc offset 0).

  [ Gyro ]

      gyro --calacc        Callibrate the accelerometer.
      gyro --calmag-start  Begin calibrating the magnetometer.
      gyro --calmag-end    End calibrating the magnetometer.

  [ SDCard ]

