holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
      sdcard --mount
      sdcard --unmount

  [ StarNav ]

      starnav RA_HOUR RA_MIN RA_SEC DEC_D DEC_M DEC_S
    
      example: starnav 6 45 8.9 -16 42 58.0

  [ Stat ]

      stat -e     Enable print.
      stat -d     Disable print.
      stat -t     Enables/disables serial print stats and counters. Takes arguments -e, -d.
      stat --partition-table      Print partition table.
      stat --memory-ram           Print ram information.
      stat --sdcard               Print SDCard information.
      stat --system               Print system configuration.
      stat --matrix n             Print matrix switch n configuration.
      stat --matrix -A            Print configuration of all matrix switches.
      stat --map n                Print map slot n data.
      stat --map -A               Print all map slot data.
      stat --sentence -A          Print all sentences. Takes arguments -e, -d.
      stat --sentence --satio     Takes arguments -e, -d.
      stat --sentence --ins       Takes arguments -e, -d.
      stat --sentence --gngga     Takes arguments -e, -d.
      stat --sentence --gnrmc     Takes arguments -e, -d.
      stat --sentence --gpatt     Takes arguments -e, -d.
      stat --sentence --matrix    Takes arguments -e, -d.
      stat --sentence --admplex0  Takes arguments -e, -d.
      stat --sentence --gyro0     Takes arguments -e, -d.
      stat --sentence --sun       Takes arguments -e, -d.
      stat --sentence --moon      Takes arguments -e, -d.
      stat --sentence --mercury   Takes arguments -e, -d.
      stat --sentence --venus     Takes arguments -e, -d.
      stat --sentence --mars      Takes arguments -e, -d.
      stat --sentence --jupiter   Takes arguments -e, -d.
      stat --sentence --saturn    Takes arguments -e, -d.
      stat --sentence --uranus    Takes arguments -e, -d.
      stat --sentence --neptune   Takes arguments -e, -d.
      stat --sentence --meteors   Takes arguments -e, -d.

  [ Other ]

      -v    Enable verbosoity.
      -vv   Enable extra verbosoity.
      help
  )"
  );
}

void PrintSystemData(void) {
    Serial.println("-----------------------------------------------------");
    Serial.println("[System] ");
    Serial.println("[serial_command] " + String(systemData.serial_command));
    Serial.println("[output_satio_all] " + String(systemData.output_satio_all));
    Serial.println("[output_satio_enabled] " + String(systemData.output_satio_enabled));
    Serial.println("[output_ins_enabled] " + String(systemData.output_ins_enabled));
    Serial.println("[output_gngga_enabled] " + String(systemData.output_gngga_enabled));
    Serial.println("[output_gnrmc_enabled] " + String(systemData.output_gnrmc_enabled));
    Serial.println("[output_gpatt_enabled] " + String(systemData.output_gpatt_enabled));
    Serial.println("[output_matrix_enabled] " + String(systemData.output_matrix_enabled));
    Serial.println("[output_admplex0_enabled] " + String(systemData.output_admplex0_enabled));
    Serial.println("[output_gyro_0_enabled] " + String(systemData.output_gyro_0_enabled));
    Serial.println("[output_sun_enabled] " + String(systemData.output_sun_enabled));
    Serial.println("[output_moon_enabled] " + String(systemData.output_moon_enabled));
    Serial.println("[output_mercury_enabled] " + String(systemData.output_mercury_enabled));
    Serial.println("[output_venus_enabled] " + String(systemData.output_venus_enabled));
    Serial.println("[output_mars_enabled] " + String(systemData.output_mars_enabled));
    Serial.println("[output_jupiter_enabled] " + String(systemData.output_jupiter_enabled));
    Serial.println("[output_saturn_enabled] " + String(systemData.output_saturn_enabled));
    Serial.println("[output_uranus_enabled] " + String(systemData.output_uranus_enabled));
    Serial.println("[output_neptune_enabled] " + String(systemData.output_neptune_enabled));
    Serial.println("[output_meteors_enabled] " + String(systemData.output_meteors_enabled));
    Serial.println("-----------------------------------------------------");
}

void PrintSatIOData(void) {
    Serial.println("-----------------------------------------------------");
    Serial.println("[SatIO] ");
    Serial.println("[coordinate_conversion_mode] " +
      String(satioData.char_coordinate_conversion_mode[satioData.coordinate_conversion_mode]));
    Serial.println("[speed_conversion_mode] " +
      String(satioData.char_speed_conversion_mode[satioData.speed_conversion_mode]));
    Serial.println("[utc_second_offset] " + String(satioData.utc_second_offset));
    Serial.println("[utc_auto_offset_flag] " + String(satioData.utc_auto_offset_flag));
    Serial.println("[set_time_automatically] " + String(satioData.set_time_automatically));
    Serial.println("-----------------------------------------------------");
}

void PrintMappingNData(int map_slot) {
  if (map_slot>=0 && map_slot<MAX_MAP_SLOTS) {
    Serial.println("-----------------------------------------------------");
    Serial.println("[slot] " + String(map_slot));
    Serial.println("[map_mode] " + String(mappingData.map_mode[0][map_slot]));
    Serial.println("[map slot idx] " + String(mappingData.index_mapped_value[0][map_slot]));
    Serial.println("[map config 0] " + String(mappingData.mapping_config[0][map_slot][0]));
    Serial.println("[map config 1] " + String(mappingData.mapping_config[0][map_slot][1]));
    Serial.println("[map config 2] " + String(mappingData.mapping_config[0][map_slot][2]));
    Serial.println("[map config 3] " + String(mappingData.mapping_config[0][map_slot][3]));
    Serial.println("[map config 4] " + String(mappingData.mapping_config[0][map_slot][4]));
    Serial.println("[map config 5] " + String(mappingData.mapping_config[0][map_slot][5]));
    Serial.println("-----------------------------------------------------");
  }
}

void PrintMappingData(void) {
  for (int Mi=0; Mi<MAX_MAP_SLOTS; Mi++) {PrintMappingNData(Mi);}
}

void PrintMatrixNData(int matrix_index) {
  if (matrix_index>=0 && matrix_index<MAX_MATRIX_SWITCHES) {
    Serial.println("-----------------------------------------------------");
    Serial.println("[matrix switch] " + String(matrix_index));
    Serial.println("[computer assist] " + String(matrixData.computer_assist[0][matrix_index]));
    Serial.println("[output mode] " + String(matrixData.output_mode[0][matrix_index]));
    Serial.println("[flux] " + String(matrixData.flux_value[0][matrix_index]));
    Serial.println("[pwm] 0: " + String(matrixData.output_pwm[0][matrix_index][0]) + " 1: " +
      String(matrixData.output_pwm[0][matrix_index][1]));
    Serial.println("[port] " + String(matrixData.matrix_port_map[0][matrix_index]));
    Serial.println("[active] " + String(matrixData.switch_intention[0][matrix_index]));
    Serial.println("-----------------------------------------------------");
    for (int Fi=0; Fi<MAX_MATRIX_SWITCH_FUNCTIONS; Fi++) {
      Serial.println("[function " + String(Fi) + " name] " +
        String(matrixData.matrix_function_names[matrixData.matrix_function[0][matrix_index][Fi]]));
      Serial.println("[function " + String(Fi) + " matrix_function_operator_name] " +
        String(matrixData.matrix_switch_operator_index[0][matrix_index][Fi]));
      Serial.println("[function " + String(Fi) + " inverted] " +
        String(matrixData.matrix_switch_inverted_logic[0][matrix_index][Fi]));
      Serial.println("[function " + String(Fi) + " x] " +
        String(matrixData.matrix_function_xyz[0][matrix_index][Fi][INDEX_MATRIX_FUNTION_X]));
      Serial.println("[function " + String(Fi) + " y] " +
        String(matrixData.matrix_function_xyz[0][matrix_index][Fi][INDEX_MATRIX_FUNTION_Y]));
      Serial.println("[function " + String(Fi) + " z] " +
        String(matrixData.matrix_function_xyz[0][matrix_index][Fi][INDEX_MATRIX_FUNTION_Z]));
      Serial.println("-----------------------------------------------------");
    }
  }
}

