holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
void PrintMatrixData(void) {
    for (int Mi=0; Mi<MAX_MATRIX_SWITCHES; Mi++) {PrintMatrixNData(Mi);}
}

void PrintSDCardInformation() {
  Serial.println("sdcard inserted:    " + String(sdcardData.sdcard_inserted));
  Serial.println("sdcard mounted:     " + String(sdcardData.sdcard_mounted));
  Serial.println("sdcard mount point: " + String(sdcardData.sdcard_mountpoint));
  Serial.println("sdcard type:        " +
    String(sdcardData.sdcard_type_names[sdcardData.sdcard_type]) +
    " (type: " + String(sdcardData.sdcard_type) + ").");
  Serial.println("sdcard card size:   " + String(sdcardData.sdcard_card_size));
  Serial.println("sdcard total bytes: " + String(sdcardData.sdcard_total_bytes));
  Serial.println("sdcard used bytes:  " + String(sdcardData.sdcard_used_bytes));
  Serial.println("sdcard sector size: " + String(sdcardData.sdcard_sector_size));
}

void setAllSentenceOutput(bool enable) {
  systemData.output_satio_enabled=enable;
  systemData.output_gngga_enabled=enable;
  systemData.output_gnrmc_enabled=enable;
  systemData.output_gpatt_enabled=enable;
  systemData.output_ins_enabled=enable;
  systemData.output_matrix_enabled=enable;
  systemData.output_admplex0_enabled=enable;
  systemData.output_gyro_0_enabled=enable;
  systemData.output_sun_enabled=enable;
  systemData.output_moon_enabled=enable;
  systemData.output_mercury_enabled=enable;
  systemData.output_venus_enabled=enable;
  systemData.output_mars_enabled=enable;
  systemData.output_jupiter_enabled=enable;
  systemData.output_saturn_enabled=enable;
  systemData.output_uranus_enabled=enable;
  systemData.output_neptune_enabled=enable;
  systemData.output_meteors_enabled=enable;
}

void setMatrixPort(int switch_idx, signed int port_n) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && port_n>=-1 && port_n<MAX_MATRIX_SWITCHES) {
    matrixData.matrix_port_map[0][switch_idx]=port_n;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixFunction(int switch_idx, int func_idx, int func_n) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && func_idx>=0 &&
      func_idx<MAX_MATRIX_SWITCH_FUNCTIONS &&
      func_n>=0 &&
      func_n<MAX_MATRIX_FUNCTION_NAMES) {
    matrixData.matrix_function[0][switch_idx][func_idx]=func_n;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixX(int switch_idx, int func_idx, double func_x) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES &&
      func_idx>=0 && func_idx<MAX_MATRIX_SWITCH_FUNCTIONS &&
      func_x>=DBL_MIN &&
      func_x<DBL_MAX) {
    matrixData.matrix_function_xyz[0][switch_idx][func_idx][INDEX_MATRIX_FUNTION_X]=func_x;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixY(int switch_idx, int func_idx, double func_y) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && func_idx>=0 &&
      func_idx<MAX_MATRIX_SWITCH_FUNCTIONS && func_y>=DBL_MIN &&
      func_y<DBL_MAX) {
    matrixData.matrix_function_xyz[0][switch_idx][func_idx][INDEX_MATRIX_FUNTION_Y]=func_y;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixZ(int switch_idx, int func_idx, double func_z) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && func_idx>=0 &&
      func_idx<MAX_MATRIX_SWITCH_FUNCTIONS && func_z>=DBL_MIN && func_z<DBL_MAX) {
    matrixData.matrix_function_xyz[0][switch_idx][func_idx][INDEX_MATRIX_FUNTION_Z]=func_z;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixInverted(int switch_idx, int func_idx, int func_i) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && func_idx>=0 &&
      func_idx<MAX_MATRIX_SWITCH_FUNCTIONS && func_i>=0 && func_i<=1) {
    matrixData.matrix_switch_inverted_logic[0][switch_idx][func_idx]=func_i;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixOperator(int switch_idx, int func_idx, int func_o) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && func_idx>=0 &&
      func_idx<MAX_MATRIX_SWITCH_FUNCTIONS && func_o>=0 && func_o<MAX_MATRIX_OPERATORS) {
    matrixData.matrix_switch_operator_index[0][switch_idx][func_idx]=func_o;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixModulation(int switch_idx, uint32_t pwm0, uint32_t pwm1) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && pwm0>=0 &&
      pwm0<UINT32_MAX && pwm1>=0 && pwm1<UINT32_MAX) {
    matrixData.output_pwm[0][switch_idx][0]=pwm0;
    matrixData.output_pwm[0][switch_idx][1]=pwm1;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setFlux(int switch_idx, uint32_t flux) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES &&
      flux>=0 && flux<LONG_MAX) {
    matrixData.flux_value[0][switch_idx]=flux;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setOutputMode(int switch_idx, int output_mode) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES &&
      output_mode>=0 && output_mode<MAX_MATRIX_OUTPUT_MODES) {
    matrixData.output_mode[0][switch_idx]=output_mode;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setOverrideOutputValue(int switch_idx, uint32_t override_value) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES &&
      override_value>=LONG_MIN && override_value<LONG_MAX) {
    matrixData.computer_assist[0][switch_idx]=false;
    matrixData.override_output_value[0][switch_idx]=override_value;
    long i_retry;
    while (matrixData.computer_assist[0][switch_idx]!=false) {
      matrixData.computer_assist[0][switch_idx]=false;
      i_retry++;
      if (i_retry==MAX_MATRIX_OVERRIDE_TIME)
        {Serial.println("WARNING! Could not override computer_assist!"); break;}
      delayMicroseconds(1);
    }
    i_retry=0;
    while (matrixData.override_output_value[0][switch_idx]!=override_value) {
      matrixData.override_output_value[0][switch_idx]=override_value;
      i_retry++;
      if (i_retry==MAX_MATRIX_OVERRIDE_TIME)
        {Serial.println("WARNING! Could not override override_output_value!"); break;}
      delayMicroseconds(1);
    }
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

char *cmd_proc_xyzptr;

void setComputerAssist(int switch_idx, bool computer_assist) {
  debug("[setComputerAssist] switch_idx:" + String(switch_idx) + "  computer_assist: " + String(computer_assist));
  debug("[setComputerAssist] current computer_assist: " + String(matrixData.computer_assist[0][switch_idx]));
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && computer_assist>=0 && computer_assist<=1) {
    matrixData.computer_assist[0][switch_idx]=computer_assist;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
  else {debug("[setComputerAssist] failed to change computer assist!");}
  debug("[setComputerAssist] computer_assist: " + String(matrixData.computer_assist[0][switch_idx]));
}

void setINSMode(int ins_mode) {
  if (ins_mode>=0 && ins_mode <MAX_INS_MODE)
    {insData.INS_MODE=ins_mode;}
}

void setINSUseGyroHeading(int use_gyro_heading) {
  if (use_gyro_heading>=0 && use_gyro_heading<=1)
    {insData.INS_USE_GYRO_HEADING=use_gyro_heading;}
}

void setINSGPSPrecision(double ins_precision) {
  if (ins_precision>=0 && ins_precision<DBL_MAX)
    {insData.INS_REQ_GPS_PRECISION=ins_precision;}
}

void setINSMinSpeed(double ins_min_speed) {
  if (ins_min_speed>=0 && ins_min_speed<DBL_MAX)
    {insData.INS_REQ_MIN_SPEED=ins_min_speed;}
}

void setINSHeadingRangeDiff(double ins_range_diff) {
  if (ins_range_diff>=0 && ins_range_diff<DBL_MAX)
    {insData.INS_REQ_HEADING_RANGE_DIFF=ins_range_diff;}
}

void setSpeedUnits(int speed_units) {
  if (speed_units>=0 && speed_units <MAX_SPEED_CONVERSION_MODES)
    {satioData.speed_conversion_mode=speed_units;}
}

