holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
/*
  Debug ArgParse.
  Expected behaviour:
  command: foo -a -b -c
  flags:   a b c
  command: foo -a 1 -b 2 -c 3
  flags:   a="1" b="2" c="3"
  Note:
    - For best practice only use ArgParser if flags are required, else use PlainArgParser for simple tokenization.
    - Use PlainArgParser if processing negative numbers.
    - short flags: 1-3 alphanumeric chars. example: -a, -a1, -a12, -abc.
    - long flags: 1-256 alphanumeric chars. example: --foobar, --foo-bar, --foobar123.
    - see ArgParser for more details.
*/
size_t pos_count;
const char** pos;
bool verbose;
bool verbose_1;
bool enable;

void printArgParse() {
  Serial.println("-------------------------------------------");
  Serial.print("[debug] First command: ");
  if (pos_count > 0) {Serial.println(pos[0]);}
  else {Serial.println("none");}
  Serial.print("[debug] Positionals (");
  Serial.print(pos_count);
  Serial.print("): ");
  for (size_t j = 0; j < pos_count; ++j)
    {Serial.print(pos[j]); if (j < pos_count - 1) Serial.print(" ");}
  Serial.println();
  Serial.println("----");
  Serial.print("[debug] Flag count: ");
  Serial.println(parser.flag_count);
  Serial.print("[debug] Flags: ");
  for (size_t k = 0; k < parser.flag_count; ++k)
    {Serial.print(parser.flags[k]); const char* val = parser.values[k];
      if (val[0] != '\0') {Serial.print("=\""); Serial.print(val); Serial.print("\"");}
      if (k < parser.flag_count - 1) Serial.print(" ");
  }
  Serial.println();
  Serial.println("-------------------------------------------");
}

// ---------------------------------------------------------------------------------------------------------------
/*
  Serial RXD : Command Process.
*/
// ---------------------------------------------------------------------------------------------------------------
void CmdProcess(void) {
  memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
  while (Serial.available())
    {Serial.readBytesUntil('\n', serial0Data.BUFFER, sizeof(serial0Data.BUFFER)-1);}
  if (strlen(serial0Data.BUFFER)>=2) {
    // Debug Serial Buffer.
    Serial.println("[CmdProcess] " + String(serial0Data.BUFFER));
    // Initialize argparse.
    argparser_reset(&parser);
    if (!argparser_init_from_buffer(&parser, serial0Data.BUFFER))
      {fprintf(stderr, "[cmd] Failed to initialize parser from buffer\n"); return;}
    pos_count=0; pos={}; pos = argparser_get_positionals(&parser, &pos_count);
    // Verbosity.
    verbose=false; verbose_1=false;
    verbose = argparser_get_bool(&parser, "v") || argparser_get_bool(&parser, "verbose");
    verbose_1 = argparser_get_bool(&parser, "vv") || argparser_get_bool(&parser, "verbose1");
    if (verbose_1) {verbose=true;}
    if (verbose==false) {verbose_1=false;}
    Serial.println("[cmd] verbose: " + String(verbose));
    Serial.println("[cmd] verbose1: " + String(verbose_1));
    // Debug Arg Parse.
    printArgParse();
    // Commands.
    if (strcmp(pos[0], "help")==0 || strcmp(pos[0], "h")==0)
      {printf("Usage: [buffer with] [--flag value] [-f value] [positional...]\n");
      if (verbose) {PrintHelp();}
    }
    else if (strcmp(pos[0], "stat")==0) {
      enable=false;
      if (argparser_has_flag(&parser, "disable") || argparser_has_flag(&parser, "d")) {enable=false;}
      else if (argparser_has_flag(&parser, "enable") || argparser_has_flag(&parser, "e")) {enable=true;}

      if (argparser_has_flag(&parser, "t")) {
        if (enable) {systemData.output_stat=enable; systemData.output_stat_v=verbose; systemData.output_stat_vv=verbose_1;}
        else {systemData.output_stat=false; systemData.output_stat_v=false; systemData.output_stat_vv=false;}
      }
      if (argparser_has_flag(&parser, "partition-table")) {print_partition_table();}

      if (argparser_has_flag(&parser, "memory-ram")) {print_ram_info();}

      if (argparser_has_flag(&parser, "sdcard")) {PrintSDCardInformation();}

      if (strcmp(serial0Data.BUFFER, "stat --system")==0) {PrintSystemData();}

      if (strncmp(serial0Data.BUFFER, "stat --matrix ", strlen("stat --matrix "))==0) {
        if (argparser_has_flag(&parser, "A")) {PrintMatrixData();}
        else {PrintMatrixNData(argparser_get_int8(&parser, "matrix", -1));}
      }

      else if (strncmp(serial0Data.BUFFER, "stat -map ", strlen("stat -map "))==0) {
        if (argparser_has_flag(&parser, "A")) {PrintMappingData();}
        else {PrintMappingNData(argparser_get_int8(&parser, "map", -1));}
      }

      else if (argparser_has_flag(&parser, "sentence")) {
        if (argparser_has_flag(&parser, "A")) {systemData.output_satio_all=enable; setAllSentenceOutput(enable);}
        if (argparser_has_flag(&parser, "satio")) {systemData.output_satio_enabled=enable;}
        if (argparser_has_flag(&parser, "gngga")) {systemData.output_gngga_enabled=enable;}
        if (argparser_has_flag(&parser, "gnrmc")) {systemData.output_gnrmc_enabled=enable;}
        if (argparser_has_flag(&parser, "gpatt")) {systemData.output_gpatt_enabled=enable;}
        if (argparser_has_flag(&parser, "ins")) {systemData.output_ins_enabled=enable;}
        if (argparser_has_flag(&parser, "matrix")) {systemData.output_matrix_enabled=enable;}
        if (argparser_has_flag(&parser, "admplex0")) {systemData.output_admplex0_enabled=enable;}
        if (argparser_has_flag(&parser, "gyro0")) {systemData.output_gyro_0_enabled=enable;}
        if (argparser_has_flag(&parser, "sun")) {systemData.output_sun_enabled=enable;}
        if (argparser_has_flag(&parser, "moon")) {systemData.output_moon_enabled=enable;}
        if (argparser_has_flag(&parser, "mercury")) {systemData.output_mercury_enabled=enable;}
        if (argparser_has_flag(&parser, "venus")) {systemData.output_venus_enabled=enable;}
        if (argparser_has_flag(&parser, "mars")) {systemData.output_mars_enabled=enable;}
        if (argparser_has_flag(&parser, "jupiter")) {systemData.output_jupiter_enabled=enable;}
        if (argparser_has_flag(&parser, "saturn")) {systemData.output_saturn_enabled=enable;}
        if (argparser_has_flag(&parser, "uranus")) {systemData.output_uranus_enabled=enable;}
        if (argparser_has_flag(&parser, "neptune")) {systemData.output_neptune_enabled=enable;}
        if (argparser_has_flag(&parser, "meteors")) {systemData.output_meteors_enabled=enable;}
      }
    }
    
