holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
    else if (strcmp(pos[0], "ls")==0) {
      const char* path_str = argparser_get_path(&parser, "/");
      Serial.println("[cmd] Path: " + String(path_str));
      int maxlevels=0;
      if (argparser_has_flag(&parser, "R")) {maxlevels=-1;}
      else {maxlevels = argparser_get_int8(&parser, "maxlevels", 1);}
      memset(sdmmcArgData.buffer, 0, sizeof(sdmmcArgData.buffer));
      strcpy(sdmmcArgData.buffer, path_str);
      sdmmcArgData.maxlevels=maxlevels;
      sdmmcFlagData.no_delay_flag=true;
      sdmmcFlagData.list_dir_flag=true;
    }

    else if (strcmp(pos[0], "starnav")==0) {star_nav();}
    
    if (systemData.serial_command) {

      if (strcmp(pos[0], "system")==0) {
        if (argparser_has_flag(&parser, "save")) {sdmmcFlagData.save_system=true;}
        else if (argparser_has_flag(&parser, "load")) {sdmmcFlagData.load_system=true;}
        else if (argparser_has_flag(&parser, "restore-defaults")) {restore_system_defaults();}
      }
      else if (strcmp(pos[0], "map")==0) {
        if (argparser_has_flag(&parser, "new")) {set_all_mapping_default(); {return;}}
        else if (argparser_has_flag(&parser, "save")) {sdmmcFlagData.save_mapping=true;}
        else if (argparser_has_flag(&parser, "load")) {sdmmcFlagData.load_mapping=true;}
        else if (argparser_has_flag(&parser, "delete")) {sdmmcFlagData.delete_mapping=true;}
        else {
          int s  = argparser_get_int8(&parser, "s", -1);
          if (s==-1) {return;}
          setMapConfig(s, argparser_get_int8(&parser, "m", mappingData.map_mode[0][s]),
                       argparser_get_int32(&parser, "c0", mappingData.mapping_config[0][s][0]),
                       argparser_get_int32(&parser, "c1", mappingData.mapping_config[0][s][1]),
                       argparser_get_int32(&parser, "c2", mappingData.mapping_config[0][s][2]),
                       argparser_get_int32(&parser, "c3", mappingData.mapping_config[0][s][3]),
                       argparser_get_int32(&parser, "c4", mappingData.mapping_config[0][s][4]),
                       argparser_get_int32(&parser, "c5", mappingData.mapping_config[0][s][5]));}
      }
      else if (strcmp(pos[0], "matrix")==0) {
        if (argparser_has_flag(&parser, "startup-enable")) {matrixData.load_matrix_on_startup=true;}
        else if (argparser_has_flag(&parser, "startup-disable")) {matrixData.load_matrix_on_startup=false;}
        else if (argparser_has_flag(&parser, "new")) {set_all_matrix_default(); return;}
        else if (argparser_has_flag(&parser, "save")) {saveMatrix(argparser_get_int8(&parser, "save", -1));}
        else if (argparser_has_flag(&parser, "load")) {loadMatrix(argparser_get_int8(&parser, "load", -1));}
        else if (argparser_has_flag(&parser, "delete")) {deleteMatrix(argparser_get_int8(&parser, "delete", -1));}
        else {
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "p")) {
            setMatrixPort(argparser_get_int8(&parser, "s", -1), argparser_get_int8(&parser, "p", -1));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "f") && argparser_has_flag(&parser, "fn")) {
            setMatrixFunction(argparser_get_int8(&parser, "s", -1), argparser_get_int8(&parser, "f", -1), argparser_get_int8(&parser, "fn", 0));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "f") && argparser_has_flag(&parser, "fx")) {
            setMatrixX(argparser_get_int8(&parser, "s", -1), argparser_get_int8(&parser, "f", 0), argparser_get_double(&parser, "fx", 0));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "f") && argparser_has_flag(&parser, "fy")) {
            setMatrixY(argparser_get_int8(&parser, "s", -1), argparser_get_int8(&parser, "f", 0), argparser_get_double(&parser, "fy", 0));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "f") && argparser_has_flag(&parser, "fz")) {
            setMatrixZ(argparser_get_int8(&parser, "s", -1), argparser_get_int8(&parser, "f", 0), argparser_get_double(&parser, "fz", 0));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "f") && argparser_has_flag(&parser, "fi")) {
            setMatrixInverted(argparser_get_int8(&parser, "s", -1), argparser_get_int8(&parser, "f", 0), argparser_get_int8(&parser, "fi", 0));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "f") && argparser_has_flag(&parser, "fo")) {
            setMatrixOperator(argparser_get_int8(&parser, "s", -1), argparser_get_int8(&parser, "f", 0), argparser_get_int8(&parser, "fo", 0));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "f") && argparser_has_flag(&parser, "pwm0") && argparser_has_flag(&parser, "pwm1")) {
            setMatrixModulation(argparser_get_int8(&parser, "s", -1), argparser_get_uint32(&parser, "pwm0", 0), argparser_get_uint32(&parser, "pwm1", 0));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "flux")) {
            setFlux(argparser_get_int8(&parser, "s", -1), argparser_get_uint32(&parser, "flux", -1));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "oride")) {
            setOverrideOutputValue(argparser_get_int8(&parser, "s", -1), argparser_get_int32(&parser, "oride", -1));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "computer-assist")) {
            setComputerAssist(argparser_get_int8(&parser, "s", -1), argparser_get_int8(&parser, "computer-assist", -1));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "omode")) {
            setOutputMode(argparser_get_int8(&parser, "s", -1), argparser_get_int8(&parser, "omode", -1));
          }
          if (argparser_has_flag(&parser, "s") && argparser_has_flag(&parser, "map-slot")) {
            setMapSlot(argparser_get_int8(&parser, "s", -1), argparser_get_int8(&parser, "map-slot", -1));
          }
        }
      }
      
