holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
      else if (strcmp(pos[0], "ins")==0) {
        if (argparser_has_flag(&parser, "m")) {setINSMode(argparser_get_int8(&parser, "m", -1));}
        if (argparser_has_flag(&parser, "gyro")) {setINSUseGyroHeading(argparser_get_int8(&parser, "gyro", -1));}
        if (argparser_has_flag(&parser, "p")) {setINSGPSPrecision(argparser_get_double(&parser, "p", -1));}
        if (argparser_has_flag(&parser, "s")) {setINSMinSpeed(argparser_get_double(&parser, "s", -1));}
        if (argparser_has_flag(&parser, "r")) {setINSHeadingRangeDiff(argparser_get_double(&parser, "r", -1));}
        if (argparser_has_flag(&parser, "reset-forced")) {insData.INS_FORCED_ON_FLAG=false;}
      }

      else if (strcmp(pos[0], "satio")==0) {
        if (argparser_has_flag(&parser, "speed-units")) {setSpeedUnits(argparser_get_int8(&parser, "speed-units", -1));}
        if (argparser_has_flag(&parser, "mode-static")) {satioData.coordinate_conversion_mode=COORDINATE_CONVERSION_MODE_STATIC;}
        if (argparser_has_flag(&parser, "set-coord")) {
          setCoordinatesDegrees(argparser_get_double(&parser, "lat", NAN),
                                argparser_get_double(&parser,  "lon", NAN));
        }
        if (argparser_has_flag(&parser, "mode-gngga")) {satioData.coordinate_conversion_mode=COORDINATE_CONVERSION_MODE_GNGGA;}
        if (argparser_has_flag(&parser, "mode-gnrmc")) {satioData.coordinate_conversion_mode=COORDINATE_CONVERSION_MODE_GNRMC;}
        if (argparser_has_flag(&parser, "utc-offset")) {setUTCSecondOffset(argparser_get_int64(&parser, "utc-offset", 0));}
        if (argparser_has_flag(&parser, "auto-datetime-on")) {datetimeSetDTAuto(true);}
        if (argparser_has_flag(&parser, "auto-datetime-off")) {datetimeSetDTAuto(false);}
        if (argparser_has_flag(&parser, "set-datetime")) {
          datetimeSetRTC(argparser_get_uint16(&parser, "year", -1),
                                 argparser_get_uint8(&parser,  "month", -1),
                                 argparser_get_uint8(&parser,  "mday", -1),
                                 argparser_get_uint8(&parser,  "hour", -1),
                                 argparser_get_uint8(&parser,  "minute", -1),
                                 argparser_get_uint8(&parser,  "second", -1));}
      }

      else if (strcmp(pos[0], "gyro")==0) {
        if (argparser_has_flag(&parser, "calacc")) {WT901CalAcc();}
        if (argparser_has_flag(&parser, "calmag-start")) {WT901CalMagStart();}
        else if (argparser_has_flag(&parser, "calmag-stop")) {WT901CalMagEnd();}
      }

      else if (strcmp(pos[0], "sdcard")==0) {
        if (argparser_has_flag(&parser, "mount")) {mountSDCard();}
        else if (argparser_has_flag(&parser, "unmount")) {unmountSDCard();}
      }
    }
  }
}

// ---------------------------------------------------------------------------------------------------------------
/*
  Serial TXD : Output.
*/
// ---------------------------------------------------------------------------------------------------------------
void outputSentences(void) {
  if (systemData.interval_breach_1_second==true) {outputStat();}

  if (systemData.interval_breach_gps) {
    systemData.interval_breach_gps=0;
    if (systemData.output_gngga_enabled) {Serial.println(gnggaData.outsentence);}
    if (systemData.output_gnrmc_enabled) {Serial.println(gnrmcData.outsentence);}
    if (systemData.output_gpatt_enabled) {Serial.println(gpattData.outsentence);}
    if (systemData.output_satio_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$SATIO,");
      strcat(serial0Data.BUFFER, String(satioData.padded_rtc_time_HHMMSS).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.padded_rtc_date_DDMMYYYY).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.padded_rtc_sync_time_HHMMSS).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.padded_rtc_sync_date_DDMMYYYY).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.padded_local_time_HHMMSS).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.padded_local_date_DDMMYYYY).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(systemData.uptime_seconds).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.degrees_latitude, 7).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.degrees_longitude, 7).c_str());
      strcat(serial0Data.BUFFER, ",");
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
  }
  if (systemData.interval_breach_ins) {
    systemData.interval_breach_ins = 0;
    if (systemData.output_ins_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$INS,");
      strcat(serial0Data.BUFFER, String(satioData.rtc_unixtime).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.INS_INITIALIZATION_FLAG).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.ins_latitude, 7).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.ins_longitude, 7).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.ins_altitude).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.ins_heading).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.ins_speed).c_str());
      strcat(serial0Data.BUFFER, ",");
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
  }
  if (systemData.interval_breach_gyro_0) {
    systemData.interval_breach_gyro_0 = 0;
    if (systemData.output_gyro_0_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$GYRO0,");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_acc_x).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_acc_y).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_acc_z).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_ang_x).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_ang_y).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_ang_z).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_gyr_x).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_gyr_y).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_gyr_z).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_mag_x).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_mag_y).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_mag_z).c_str());
      strcat(serial0Data.BUFFER, ",");
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
  }
  if (systemData.interval_breach_track_planets) {
    systemData.interval_breach_track_planets = 0;
    if (systemData.output_sun_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$SUN,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_s + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_moon_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$MOON,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_p + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_lum + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_mercury_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$MERCURY,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_venus_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$VENUS,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_mars_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$MARS,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_jupiter_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$JUPITER,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_saturn_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$SATURN,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_uranus_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$URANUS,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_neptune_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$NEPTUNE,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_meteors_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$METEOR,");
      for (int i=0; i<MAX_METEOR_SHOWERS; i++) {
        strcat(serial0Data.BUFFER, String(String(meteor_shower_warning_system[i][0]) + String(",")).c_str());
        strcat(serial0Data.BUFFER, String(String(meteor_shower_warning_system[i][1]) + String(",")).c_str());
      }
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
  }
  // if (systemData.interval_breach_matrix) {
    // systemData.interval_breach_matrix = 0;
    if (systemData.output_matrix_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcpy(serial0Data.BUFFER, "$MATRIX,");
      // append matrix switch state data
      for (int i=0; i < MAX_MATRIX_SWITCHES; i++)
        {strcat(serial0Data.BUFFER, String(String(matrixData.switch_intention[0][i])+",").c_str());}
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
  // }
  if (systemData.interval_breach_mplex) {
    systemData.interval_breach_mplex = 0;
    if (systemData.output_admplex0_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$MPLEX0,");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[0]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[1]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[2]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[3]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[4]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[5]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[6]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[7]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[8]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[9]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[10]).c_str());
