holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
    memset(counter_digits_1_row_N[0], 0, sizeof(counter_digits_1_row_N[0])); strcpy(counter_digits_1_row_N[0], String(satioData.padded_rtc_time_HHMMSS).c_str());
    memset(counter_digits_1_row_N[1], 0, sizeof(counter_digits_1_row_N[1])); strcpy(counter_digits_1_row_N[1], String(satioData.padded_rtc_date_DDMMYYYY).c_str());
    memset(counter_digits_1_row_N[2], 0, sizeof(counter_digits_1_row_N[2])); strcpy(counter_digits_1_row_N[2], String(satioData.rtc_unixtime).c_str());
    memset(counter_digits_1_row_N[3], 0, sizeof(counter_digits_1_row_N[3])); // null
    memset(counter_digits_1_row_N[4], 0, sizeof(counter_digits_1_row_N[4])); // null
    memset(counter_digits_1_row_N[5], 0, sizeof(counter_digits_1_row_N[5])); // null
    memset(counter_digits_1_row_N[6], 0, sizeof(counter_digits_1_row_N[6])); // null
    memset(counter_digits_1_row_N[7], 0, sizeof(counter_digits_1_row_N[7])); // null
    memset(counter_digits_1_row_N[8], 0, sizeof(counter_digits_1_row_N[8])); // null
    for (int i = 0; i < 10; i++) {if (i==0) {printf("%-19s", counter_chars_1_col_0[i+1]);} else {printf("%-19s", counter_digits_1_row_N[i-1]);}}
    printf("\n");

    memset(counter_digits_1_row_N[0], 0, sizeof(counter_digits_1_row_N[0])); strcpy(counter_digits_1_row_N[0], String(satioData.padded_rtc_sync_time_HHMMSS).c_str());
    memset(counter_digits_1_row_N[1], 0, sizeof(counter_digits_1_row_N[1])); strcpy(counter_digits_1_row_N[1], String(satioData.padded_rtc_sync_date_DDMMYYYY).c_str());
    memset(counter_digits_1_row_N[2], 0, sizeof(counter_digits_1_row_N[2])); strcpy(counter_digits_1_row_N[2], String(satioData.rtcsync_unixtime).c_str());
    memset(counter_digits_1_row_N[3], 0, sizeof(counter_digits_1_row_N[3])); strcpy(counter_digits_1_row_N[3], String(satioData.rtcsync_latitude).c_str());
    memset(counter_digits_1_row_N[4], 0, sizeof(counter_digits_1_row_N[4])); strcpy(counter_digits_1_row_N[4], String(satioData.rtcsync_longitude).c_str());
    memset(counter_digits_1_row_N[5], 0, sizeof(counter_digits_1_row_N[5])); strcpy(counter_digits_1_row_N[5], String(satioData.rtcsync_altitude).c_str());
    memset(counter_digits_1_row_N[6], 0, sizeof(counter_digits_1_row_N[6])); // null
    memset(counter_digits_1_row_N[7], 0, sizeof(counter_digits_1_row_N[7])); // null
    memset(counter_digits_1_row_N[8], 0, sizeof(counter_digits_1_row_N[8])); // null
    for (int i = 0; i < 10; i++) {if (i==0) {printf("%-19s", counter_chars_1_col_0[i+2]);} else {printf("%-19s", counter_digits_1_row_N[i-1]);}}
    printf("\n");

    memset(counter_digits_1_row_N[0], 0, sizeof(counter_digits_1_row_N[0])); strcpy(counter_digits_1_row_N[0], String(satioData.padded_local_time_HHMMSS).c_str());
    memset(counter_digits_1_row_N[1], 0, sizeof(counter_digits_1_row_N[1])); strcpy(counter_digits_1_row_N[1], String(satioData.padded_local_date_DDMMYYYY).c_str());
    memset(counter_digits_1_row_N[2], 0, sizeof(counter_digits_1_row_N[2])); strcpy(counter_digits_1_row_N[2], String(satioData.local_unixtime_uS).c_str());
    memset(counter_digits_1_row_N[3], 0, sizeof(counter_digits_1_row_N[3])); strcpy(counter_digits_1_row_N[3], String(satioData.degrees_latitude, 7).c_str());
    memset(counter_digits_1_row_N[4], 0, sizeof(counter_digits_1_row_N[4])); strcpy(counter_digits_1_row_N[4], String(satioData.degrees_longitude, 7).c_str());
    memset(counter_digits_1_row_N[5], 0, sizeof(counter_digits_1_row_N[5])); strcpy(counter_digits_1_row_N[5], String(satioData.altitude).c_str()); // altitude: use srtm for meters above terrain elevation level (make other conversions also)
    memset(counter_digits_1_row_N[6], 0, sizeof(counter_digits_1_row_N[6])); strcpy(counter_digits_1_row_N[6], String(satioData.ground_heading).c_str());
    memset(counter_digits_1_row_N[7], 0, sizeof(counter_digits_1_row_N[7])); strcpy(counter_digits_1_row_N[7], String(String(satioData.speed, 2) + " " + String(satioData.char_speed_conversion_mode[satioData.speed_conversion_mode])).c_str()); // speed (3 dimensional: requires lat, long, alt, microtime)
    memset(counter_digits_1_row_N[8], 0, sizeof(counter_digits_1_row_N[8])); strcpy(counter_digits_1_row_N[8], String(satioData.mileage).c_str()); // make mileage any 3d direction, refactor 'distance'
    for (int i = 0; i < 10; i++) {if (i==0) {printf("%-19s", counter_chars_1_col_0[i+3]);} else {printf("%-19s", counter_digits_1_row_N[i-1]);}}
    printf("\n");
    // utc offset
    // gforce.
    memset(counter_digits_1_row_N[0], 0, sizeof(counter_digits_1_row_N[0])); strcpy(counter_digits_1_row_N[0], String(satioData.padded_local_time_HHMMSS).c_str());
    memset(counter_digits_1_row_N[1], 0, sizeof(counter_digits_1_row_N[1])); strcpy(counter_digits_1_row_N[1], String(satioData.padded_local_date_DDMMYYYY).c_str());
    memset(counter_digits_1_row_N[2], 0, sizeof(counter_digits_1_row_N[2])); strcpy(counter_digits_1_row_N[2], String(satioData.local_unixtime_uS).c_str());
    memset(counter_digits_1_row_N[3], 0, sizeof(counter_digits_1_row_N[3])); strcpy(counter_digits_1_row_N[3], String(insData.ins_latitude, 7).c_str());
    memset(counter_digits_1_row_N[4], 0, sizeof(counter_digits_1_row_N[4])); strcpy(counter_digits_1_row_N[4], String(insData.ins_longitude, 7).c_str());
    memset(counter_digits_1_row_N[5], 0, sizeof(counter_digits_1_row_N[5])); strcpy(counter_digits_1_row_N[5], String(insData.ins_altitude).c_str());
    memset(counter_digits_1_row_N[6], 0, sizeof(counter_digits_1_row_N[6])); strcpy(counter_digits_1_row_N[6], String(insData.ins_heading).c_str());
    memset(counter_digits_1_row_N[7], 0, sizeof(counter_digits_1_row_N[7])); strcpy(counter_digits_1_row_N[7], String(String(insData.ins_speed, 2) + " " + String(satioData.char_speed_conversion_mode[satioData.speed_conversion_mode])).c_str());
    memset(counter_digits_1_row_N[8], 0, sizeof(counter_digits_1_row_N[8])); strcpy(counter_digits_1_row_N[8], String("pending").c_str());
    for (int i = 0; i < 10; i++) {if (i==0) {printf("%-19s", counter_chars_1_col_0[i+4]);} else {printf("%-19s", counter_digits_1_row_N[i-1]);}}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.println("INS MODE : " + String(insData.INS_MODE) + " (" + String(insData.char_ins_mode[insData.INS_MODE]) + ") | INS FLAG : " + String(insData.INS_INITIALIZATION_FLAG) + "/" + String(MAX_INS_INITIALIZATION_FLAG) + " | INS FORCED ON FLAG : " + String(insData.INS_FORCED_ON_FLAG)
    + " | INS_REQ_GPS_PRECISION : " + String(insData.INS_REQ_GPS_PRECISION) + " | INS_REQ_MIN_SPEED : " + String(insData.INS_REQ_MIN_SPEED) + " | INS_REQ_HEADING_RANGE_DIFF : " + String(insData.INS_REQ_HEADING_RANGE_DIFF));
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.println("                   X                  Y                  Z");
    memset(counter_digits_1_row_N[0], 0, sizeof(counter_digits_1_row_N[0])); strcpy(counter_digits_1_row_N[0], String(gyroData.gyro_0_ang_x).c_str());
    memset(counter_digits_1_row_N[1], 0, sizeof(counter_digits_1_row_N[1])); strcpy(counter_digits_1_row_N[1], String(gyroData.gyro_0_ang_y).c_str());
    memset(counter_digits_1_row_N[2], 0, sizeof(counter_digits_1_row_N[2])); strcpy(counter_digits_1_row_N[2], String(gyroData.gyro_0_ang_z).c_str());
    Serial.print("Angle              ");
    for (int i = 0; i < 3; i++) {printf("%-19s", counter_digits_1_row_N[i]);}
    printf("\n");
    memset(counter_digits_1_row_N[0], 0, sizeof(counter_digits_1_row_N[0])); strcpy(counter_digits_1_row_N[0], String(gyroData.gyro_0_gyr_x).c_str());
    memset(counter_digits_1_row_N[1], 0, sizeof(counter_digits_1_row_N[1])); strcpy(counter_digits_1_row_N[1], String(gyroData.gyro_0_gyr_y).c_str());
    memset(counter_digits_1_row_N[2], 0, sizeof(counter_digits_1_row_N[2])); strcpy(counter_digits_1_row_N[2], String(gyroData.gyro_0_gyr_z).c_str());
    Serial.print("Gyro               ");
    for (int i = 0; i < 3; i++) {printf("%-19s", counter_digits_1_row_N[i]);}
    printf("\n");
    memset(counter_digits_1_row_N[0], 0, sizeof(counter_digits_1_row_N[0])); strcpy(counter_digits_1_row_N[0], String(gyroData.gyro_0_acc_x).c_str());
    memset(counter_digits_1_row_N[1], 0, sizeof(counter_digits_1_row_N[1])); strcpy(counter_digits_1_row_N[1], String(gyroData.gyro_0_acc_y).c_str());
    memset(counter_digits_1_row_N[2], 0, sizeof(counter_digits_1_row_N[2])); strcpy(counter_digits_1_row_N[2], String(gyroData.gyro_0_acc_z).c_str());
    Serial.print("Acceleration       ");
    for (int i = 0; i < 3; i++) {printf("%-19s", counter_digits_1_row_N[i]);}
    printf("\n");
    memset(counter_digits_1_row_N[0], 0, sizeof(counter_digits_1_row_N[0])); strcpy(counter_digits_1_row_N[0], String(gyroData.gyro_0_mag_x).c_str());
    memset(counter_digits_1_row_N[1], 0, sizeof(counter_digits_1_row_N[1])); strcpy(counter_digits_1_row_N[1], String(gyroData.gyro_0_mag_y).c_str());
    memset(counter_digits_1_row_N[2], 0, sizeof(counter_digits_1_row_N[2])); strcpy(counter_digits_1_row_N[2], String(gyroData.gyro_0_mag_z).c_str());
    Serial.print("Magnetic Field     ");
    for (int i = 0; i < 3; i++) {printf("%-19s", counter_digits_1_row_N[i]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.println("Weekday int: " + String(satioData.local_wday) + " Weekday Name: " + String(satioData.local_wday_name));
    Serial.print("Meteor Warning: ");
    for (int i = 0; i < MAX_METEOR_SHOWERS; i++) {Serial.print(String(String(meteor_shower_names[i]) + ": " + String(meteor_shower_warning_system[i][0]) + " " + String(meteor_shower_warning_system[i][1]) + " | ").c_str());}
    Serial.println();
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.println("SDCard mounted: " + String(sdcardData.sdcard_mounted) + " (" + String(sdcardData.sdcard_type_names[sdcardData.sdcard_type]) + " (type: " + String(sdcardData.sdcard_type) + ")");
  }
    // ----------------------------------------------------------------------------------------------------------------------------
    //                                                                                                      PRINT PROGRAMMABLE DATA
    // ----------------------------------------------------------------------------------------------------------------------------
    if (systemData.output_stat_v==true || systemData.output_stat_vv) {
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("                      ");
    printArray(print_index_0, 0, 35);
    Serial.print("Computer Assist    :  ");
    for (int i=0;i<35;i++) {Serial.print(String(matrixData.computer_assist[0][i]) + "      ");}
    Serial.println();
    Serial.print("Switch Intention   :  ");
    for (int i=0;i<35;i++) {Serial.print(String(matrixData.switch_intention[0][i]) + "      ");}
    Serial.println();
    Serial.print("Computer Intention :  ");
    for (int i=0;i<35;i++) {Serial.print(String(matrixData.computer_intention[0][i]) + "      ");}
    Serial.println();
    Serial.print("Output Value       :  ");
    printArray(matrixData.output_value[0], 0, 35);
    }
    if (systemData.output_stat_vv) {
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("Switch Function 0  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7d", matrixData.matrix_function[0][i][0]);}
    printf("\n");
    Serial.print("Switch Function X  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][0][INDEX_MATRIX_FUNTION_X]);}
    printf("\n");
    Serial.print("Switch Function Y  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][0][INDEX_MATRIX_FUNTION_Y]);}
    printf("\n");
    Serial.print("Switch Function Z  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][0][INDEX_MATRIX_FUNTION_Z]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("Switch Function 1  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7d", matrixData.matrix_function[0][i][1]);}
    printf("\n");
    Serial.print("Switch Function X  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][1][INDEX_MATRIX_FUNTION_X]);}
    printf("\n");
    Serial.print("Switch Function Y  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][1][INDEX_MATRIX_FUNTION_Y]);}
    printf("\n");
    Serial.print("Switch Function Z  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][1][INDEX_MATRIX_FUNTION_Z]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("Switch Function 2  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7d", matrixData.matrix_function[0][i][2]);}
    printf("\n");
    Serial.print("Switch Function X  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][2][INDEX_MATRIX_FUNTION_X]);}
    printf("\n");
    Serial.print("Switch Function Y  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][2][INDEX_MATRIX_FUNTION_Y]);}
    printf("\n");
    Serial.print("Switch Function Z  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][2][INDEX_MATRIX_FUNTION_Z]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("Switch Function 3  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7d", matrixData.matrix_function[0][i][3]);}
    printf("\n");
    Serial.print("Switch Function X  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][3][INDEX_MATRIX_FUNTION_X]);}
    printf("\n");
    Serial.print("Switch Function Y  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][3][INDEX_MATRIX_FUNTION_Y]);}
    printf("\n");
    Serial.print("Switch Function Z  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][3][INDEX_MATRIX_FUNTION_Z]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("Switch Function 4  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7d", matrixData.matrix_function[0][i][4]);}
    printf("\n");
    Serial.print("Switch Function X  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][4][INDEX_MATRIX_FUNTION_X]);}
    printf("\n");
    Serial.print("Switch Function Y  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][4][INDEX_MATRIX_FUNTION_Y]);}
    printf("\n");
    Serial.print("Switch Function Z  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][4][INDEX_MATRIX_FUNTION_Z]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("Switch Function 0  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7d", matrixData.matrix_function[0][i][5]);}
    printf("\n");
    Serial.print("Switch Function X  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][5][INDEX_MATRIX_FUNTION_X]);}
    printf("\n");
    Serial.print("Switch Function Y  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][5][INDEX_MATRIX_FUNTION_Y]);}
    printf("\n");
    Serial.print("Switch Function Z  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][5][INDEX_MATRIX_FUNTION_Z]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("Switch Function 6  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7d", matrixData.matrix_function[0][i][6]);}
    printf("\n");
    Serial.print("Switch Function X  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][6][INDEX_MATRIX_FUNTION_X]);}
    printf("\n");
    Serial.print("Switch Function Y  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][6][INDEX_MATRIX_FUNTION_Y]);}
    printf("\n");
    Serial.print("Switch Function Z  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][6][INDEX_MATRIX_FUNTION_Z]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("Switch Function 7  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7d", matrixData.matrix_function[0][i][7]);}
    printf("\n");
    Serial.print("Switch Function X  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][7][INDEX_MATRIX_FUNTION_X]);}
    printf("\n");
    Serial.print("Switch Function Y  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][7][INDEX_MATRIX_FUNTION_Y]);}
    printf("\n");
    Serial.print("Switch Function Z  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][7][INDEX_MATRIX_FUNTION_Z]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("Switch Function 8  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7d", matrixData.matrix_function[0][i][8]);}
    printf("\n");
    Serial.print("Switch Function X  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][8][INDEX_MATRIX_FUNTION_X]);}
    printf("\n");
    Serial.print("Switch Function Y  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][8][INDEX_MATRIX_FUNTION_Y]);}
    printf("\n");
    Serial.print("Switch Function Z  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][8][INDEX_MATRIX_FUNTION_Z]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("Switch Function 9  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7d", matrixData.matrix_function[0][i][9]);}
    printf("\n");
    Serial.print("Switch Function X  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][9][INDEX_MATRIX_FUNTION_X]);}
    printf("\n");
    Serial.print("Switch Function Y  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][9][INDEX_MATRIX_FUNTION_Y]);}
    printf("\n");
    Serial.print("Switch Function Z  :  ");
    for (int i = 0; i < 35; i++) {printf("%-7.0f", matrixData.matrix_function_xyz[0][i][9][INDEX_MATRIX_FUNTION_Z]);}
    printf("\n");
    }
    if (systemData.output_stat_v==true || systemData.output_stat_vv) {
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("                      ");
    printArray(print_index_1, 0, 35);
    Serial.print("Computer Assist    :  ");
    for (int i=35;i<70;i++) {Serial.print(String(matrixData.computer_assist[0][i]) + "      ");}
    Serial.println();
    Serial.print("Switch Intention   :  ");
    for (int i=35;i<70;i++) {Serial.print(String(matrixData.switch_intention[0][i]) + "      ");}
    Serial.println();
    Serial.print("Computer Intention :  ");
    for (int i=35;i<70;i++) {Serial.print(String(matrixData.computer_intention[0][i]) + "      ");}
    Serial.println();
    Serial.print("Output Value       :  ");
    printArray(matrixData.output_value[0], 35, 70);
    }
    if (systemData.output_stat_vv) {
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("Switch Function 0  :  ");
    for (int i = 35; i < 70; i++) {printf("%-7d", matrixData.matrix_function[0][i][0]);}
    printf("\n");
    Serial.print("Switch Function X  :  ");
